CylRAS/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1183 0 0);

boundaryField
{
    cylinder
    {
        type            noSlip; //fixedValue
        //value           uniform (0 0 0);
    }
    periodicity1
    {
        type            empty;
    }
    periodicity2
    {
        type            empty;
    }
    inFlow
    {
        type            inletOutlet;
        inletValue      uniform (0.1183 0 0);
    }
    wake2
    {
        type            zeroGradient;
    }
    wake1
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
