CylRAS/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.0000014616; 

boundaryField
{

    cylinder
    {
       type 		compressible::alphatWallFunction;
       Prt		0.85;
       value 	        uniform 0.0000014616; 
    }

    periodicity1
    {
        type            empty;
    }

    periodicity2
    {
        type            empty;
    }

    inFlow
    {
        type            calculated; //inletOutlet;
        value           uniform 0.0000014616;           
    }

    wake2
    {
        type            zeroGradient;
    }

    wake1
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
