CylRAS/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
   init
   {
        field U;
        expression "vector (M0*c0*sin(x1)*cos(x2)*cos(x3),-M0*c0*cos(x1)*sin(x2)*cos(x3),0)";
        variables 
        (
            "x1=pos().x;"
            "x2=pos().y;"
            "x3=pos().z;"
	    "M0=0.01;"
	    "T0=293.15;"
	    "R=288.19;"
	    "c0=344;"
	    
        );
    }

    init
    {
        field p;
        expression "101325 +M0*M0*c0*c0*( (cos(2*x3)+2)*(cos(2*x1)+cos(2*x2))-2 )/16";
        variables 
        (
            "x1=pos().x;"
            "x2=pos().y;"
            "x3=pos().z;"
	    "M0=0.01;"
	    "c0=344;"
        );
    }

      init
    {
        field T;
        expression "(101325 +M0*M0*c0*c0*( (cos(2*x3)+2)*(cos(2*x1)+cos(2*x2))-2 )/16) / (rho*R)";
        variables 
        (
            "R=288.189780685556;"
	    "M0=0.01;"
	    "c0=344;"
            "rho=1.2;"
            "x1=pos().x;"
            "x2=pos().y;"
            "x3=pos().z;"
        );
    }
   //   init
   // {
   //     field vorticity;
   //     expression "curl(U)";
   // }
);
